app/views/passenger_mailer/booking_info.html.erb

SELECT  "bookings".* FROM "bookings" INNER JOIN "passenger_bookings" ON "bookings"."id" = "passenger_bookings"."booking_id" WHERE "passenger_bookings"."passenger_id" = ?  ORDER BY "bookings"."id" DESC LIMIT 1  [["passenger_id", 1]]
---

<%= link_to "Booking Info", booking_url(@passenger.bookings.last) %>