app/views/bookings/show.html.erb

SELECT "passengers".* FROM "passengers" INNER JOIN "passenger_bookings" ON "passengers"."id" = "passenger_bookings"."passenger_id" WHERE "passenger_bookings"."booking_id" = ?  [["booking_id", 1]]
SELECT COUNT(*) FROM "passengers" INNER JOIN "passenger_bookings" ON "passengers"."id" = "passenger_bookings"."passenger_id" WHERE "passenger_bookings"."booking_id" = ?  [["booking_id", 1]]
---
<% passengers_count = @booking.passengers.count %>