app/controllers/flights_controller.rb

  def index
    @flight = Flight.new
    @airports = Airport.all.map { |airport| [airport.city, airport.id] }
    @dates = Flight.order("date asc").all.map { |flight| [flight.date.strftime("%d/%m/%Y")] }.uniq
---
SELECT "airports".* FROM "airports"
SELECT "flights".* FROM "flights"  ORDER BY date asc